Revit 2027 API
Pipe.IsPipeTypeId Method
 Checks if given type is valid pipe type.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsPipeTypeId(
	Document document,
	ElementId pipeTypeId
)
Public Shared Function IsPipeTypeId (
	document As Document,
	pipeTypeId As ElementId
) As Boolean
public:
static bool IsPipeTypeId(
	Document^ document,
	ElementId^ pipeTypeId
)
static member IsPipeTypeId :
        document : Document *
        pipeTypeId : ElementId -> bool
Parameters
document Document
 The document.
pipeTypeId ElementId
 ElementId of the pipe type to check.
Return Value
Boolean
 True if pipe type can used for this pipe, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 A type is valid for pipe if it can be used to the pipe element.
See Also
Reference
Pipe Class
Autodesk.Revit.DB.Plumbing Namespace